Revit 2027 API
StairsType.MaxRiserHeight Property
 The maximum height of each riser on the stair element.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MaxRiserHeight { get; set; }
Public Property MaxRiserHeight As Double
	Get
	Set
public:
property double MaxRiserHeight {
	double get ();
	void set (double value);
}
member MaxRiserHeight : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for maxRiserHeight must be greater than 0 and no more than 30000 feet.
See Also
Reference
StairsType Class
Autodesk.Revit.DB.Architecture Namespace